In [1]:
import pandas as pd


# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Aarav', 'Isha', None, 'Rohan'],
    'Marks': [85, None, 90, 78],
    'City': ['Mumbai', 'Delhi', 'Chennai', None]
})

print(df)

    Name  Marks     City
0  Aarav   85.0   Mumbai
1   Isha    NaN    Delhi
2   None   90.0  Chennai
3  Rohan   78.0     None

In [3]:
import pandas as pd


# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Aarav', 'Isha', None, 'Rohan'],
    'Marks': [85, None, 90, 78],
    'City': ['Mumbai', 'Delhi', 'Chennai', None]
})

print(df)

df.dropna(axis=0, how='all')

    Name  Marks     City
0  Aarav   85.0   Mumbai
1   Isha    NaN    Delhi
2   None   90.0  Chennai
3  Rohan   78.0     None

    Name  Marks     City
0  Aarav   85.0   Mumbai
1   Isha    NaN    Delhi
2   None   90.0  Chennai
3  Rohan   78.0     None

In [7]:
import pandas as pd


# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Aarav', 'Isha', None, 'Rohan'],
    'Marks': [85, None, 90, 78],
    'City': ['Mumbai', 'Delhi', 'Chennai', None]
})

print(df)

df_subset=df.dropna(subset=['Name'])
print(df_subset)

    Name  Marks     City
0  Aarav   85.0   Mumbai
1   Isha    NaN    Delhi
2   None   90.0  Chennai
3  Rohan   78.0     None
    Name  Marks    City
0  Aarav   85.0  Mumbai
1   Isha    NaN   Delhi
3  Rohan   78.0    None

In [14]:
import pandas as pd


# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Aarav', None,'Isha', 'Rohan'],
    'Marks': [85, None, 90, 78],
    'City': ['Mumbai', None,'Delhi','Chennai']
}) 
print(df)
df.fillna(0)

    Name  Marks     City
0  Aarav   85.0   Mumbai
1   None    NaN     None
2   Isha   90.0    Delhi
3  Rohan   78.0  Chennai

    Name  Marks     City
0  Aarav   85.0   Mumbai
1      0    0.0        0
2   Isha   90.0    Delhi
3  Rohan   78.0  Chennai

In [23]:
import pandas as pd


# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Aarav', None,'Isha', 'Rohan'],
    'Marks': [85, None, 90, 78],
    'City': ['Mumbai', None,'Delhi','Chennai']
}) 
print(df)
df['Marks'] = df['Marks'].fillna(df['Marks'].mean())
print(df)

    Name  Marks     City
0  Aarav   85.0   Mumbai
1   None    NaN     None
2   Isha   90.0    Delhi
3  Rohan   78.0  Chennai
    Name      Marks     City
0  Aarav  85.000000   Mumbai
1   None  84.333333     None
2   Isha  90.000000    Delhi
3  Rohan  78.000000  Chennai

In [39]:
import pandas as pd


data = {
    'Day': [1, 2, 3, 4, 5, 6, 7],
    'Temperature': [30, None, None, 40, None, 50, None]
}

df = pd.DataFrame(data)
print(df)

df_linear = df.copy()
df_linear['Temperature'] = df_linear['Temperature'].interpolate(method='linear')
print("Linear interpolation:")
print(df_linear)

   Day  Temperature
0    1         30.0
1    2          NaN
2    3          NaN
3    4         40.0
4    5          NaN
5    6         50.0
6    7          NaN
Linear interpolation:
   Day  Temperature
0    1    30.000000
1    2    33.333333
2    3    36.666667
3    4    40.000000
4    5    45.000000
5    6    50.000000
6    7    50.000000